SunCity/src/Documents/УведомлениеОРасхожденииИСМПТК/УведомлениеОРасхожденииИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОРасхожденииИСМПТК</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеУведомлениеОРасхожденииИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИСМПТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВИСМПТ</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ХозяйственныеОперацииИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияДокументовИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументовИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвязанныйАкт</name>
    <comment>Исправляемый Акт</comment>
    <type>
      <types>DocumentRef.АктПриемаПередачиИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьАктКорректировка</name>
    <type>
      <types>DocumentRef.АктПриемаПередачиИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерСвязанногоАкта</name>
    <comment>Используется в АПИ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>42</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>DefinedType.ПоставщикПолучательИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>450</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикИдентификационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ПоставщикПолучательИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>450</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательИдентификационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательНерезидент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегНомерНаБумажномНосителе</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпискиНаБумажномНосителе</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.ПользователиИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>EnumRef.ВидыПродукцииИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАПППервичный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАППИсправленный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Марки</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУпаковки</name>
      <type>
        <types>EnumRef.ВидыУпаковокИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество потребительских упаковок</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсточник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодИдентификации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСверкиКода</name>
      <type>
        <types>EnumRef.СтатусыСверкиКодаИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>EnumRef.ВидыПродукцииИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>GTINВерхнегоУровня</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ошибки</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SunCity/src/Enums/СостоянияДокументовИСМПТК/СостоянияДокументовИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДокументовИСМПТК</name>
  <comment>(Внутри)</comment>
  <enumValues>
    <name>Сформирован</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Отозван</name>
  </enumValues>
  <enumValues>
    <name>ПринятОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ДоставленПолучателю</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненПолучателем</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденПолучателем</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненСервером</name>
  </enumValues>
  <enumValues>
    <name>ОбрабатываетсяСервером</name>
  </enumValues>
  <enumValues>
    <name>ПринятСервером</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДанных</name>
  </enumValues>
  <enumValues>
    <name>ПринятПроверен</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/СтатусыДокументовИСМПТК/СтатусыДокументовИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовИСМПТК</name>
  <comment>(Сервер)</comment>
  <enumValues>
    <name>Черновик</name>
    <comment>0</comment>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ОжидаетПриемку</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>ПринятПодтвержден</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
    <comment>5</comment>
  </enumValues>
  <enumValues>
    <name>Отозван</name>
    <comment>16</comment>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
    <comment>17</comment>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
    <comment>8</comment>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
    <comment>10</comment>
  </enumValues>
  <enumValues>
    <name>Проверяется</name>
    <comment>IN_PROGRESS</comment>
  </enumValues>
  <enumValues>
    <name>Оформлен</name>
    <comment>CHECKED_OK</comment>
  </enumValues>
  <enumValues>
    <name>ОшибкаПриПроверке</name>
    <comment>CHECKED_NOT_OK</comment>
  </enumValues>
  <enumValues>
    <name>ОшибкаПриОбработке</name>
    <comment>PROCESSING_ERROR</comment>
  </enumValues>
  <enumValues>
    <name>НеОпределен</name>
    <comment>UNDEFINED</comment>
  </enumValues>
  <enumValues>
    <name>Новое</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/СтатусыСверкиКодаИСМПТК/СтатусыСверкиКодаИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСверкиКодаИСМПТК</name>
  <enumValues>
    <name>НеНайден</name>
  </enumValues>
  <enumValues>
    <name>Найден</name>
  </enumValues>
  <enumValues>
    <name>Исключен</name>
  </enumValues>
  <enumValues>
    <name>Добавлен</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/НаправленияДокументовИСМПТК/НаправленияДокументовИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправленияДокументовИСМПТК</name>
  <enumValues>
    <name>Входящий</name>
  </enumValues>
  <enumValues>
    <name>Исходящий</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ВидыДокументаИСМПТК/ВидыДокументаИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДокументаИСМПТК</name>
  <enumValues>
    <name>Исправленный</name>
  </enumValues>
  <enumValues>
    <name>Исходный</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Documents/УведомлениеОРасхожденииИСМПТК/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
			ДокументОснованиеДляЗаполнения = ДанныеЗаполнения.ДокументОснование;
		Иначе
	        ДокументОснованиеДляЗаполнения = Неопределено;
		КонецЕсли;
	Иначе
		ДокументОснованиеДляЗаполнения = ДанныеЗаполнения;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ДокументОснованиеДляЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	МассивДокументов = Новый Массив();
	МассивДокументов.Добавить(ДокументОснованиеДляЗаполнения);
	
	ПараметрыЗаполнения = РаботаСДокументамиИСМПТК.ПолучитьПараметрыЗаполненияДокументовИСМПТПоУмолчанию();
	ПараметрыЗаполнения.Вставить("МассивДокументов", МассивДокументов);
		
	ТипДокументаИСМПТ = Документы.УведомлениеОРасхожденииИСМПТК.ПустаяСсылка();
	МассивДанныхДляЗаполнения = РаботаСДокументамиИСМПТК.ПодготовитьДанныеДляЗаполненияДокументаИСМПТ(ПараметрыЗаполнения, ТипДокументаИСМПТ);
	
	Если ТипЗнч(МассивДанныхДляЗаполнения) = Тип("Массив") И МассивДанныхДляЗаполнения.Количество() > 0 Тогда
		
		Для Каждого СтруктураДокумента Из МассивДанныхДляЗаполнения Цикл
			
			Если МассивДанныхДляЗаполнения.Найти(СтруктураДокумента) > 0 Тогда
				НовыйДокументУОР = Документы.УведомлениеОРасхожденииИСМПТК.СоздатьДокумент();
			Иначе
				НовыйДокументУОР = ЭтотОбъект;
			КонецЕсли; 
		
			//Заполняем шапку документа
			ЗаполнитьЗначенияСвойств(НовыйДокументУОР, СтруктураДокумента.Реквизиты[0]);
			
			//Заполняем шапку документа дополнительными сведениями
			СтруктураПереопределяемыхРеквизитов = РаботаСДокументамиИСМПТКПереопределяемый.ПолучитьЗначенияПоУмолчаниюДляСозданияУведомленияОРасхожденияхИСМПТ(МассивДокументов);
			ЗаполнитьЗначенияСвойств(НовыйДокументУОР, СтруктураПереопределяемыхРеквизитов);
			
			НовыйДокументУОР.Состояние = Перечисления.СостоянияДокументовИСМПТК.Сформирован;
			НовыйДокументУОР.Статус    = Перечисления.СтатусыДокументовИСМПТК.Черновик;  
			
			// Нужно заполнить сведения о связанных АПП
			НовыйДокументУОР.ИдентификаторАПППервичный = ДокументОснованиеДляЗаполнения.Идентификатор;
			НовыйДокументУОР.РегистрационныйНомерСвязанногоАкта = ДокументОснованиеДляЗаполнения.НомерИСМПТ;
						
			//Заполняем табличную часть "Марки"
			Если СтруктураДокумента.Свойство("Марки")
				И Не СтруктураДокумента.Марки = Неопределено Тогда
				Для Каждого СтрокаТЧ Из СтруктураДокумента.Марки Цикл
					НоваяСтрокаТЧ = НовыйДокументУОР.Марки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаТЧ);
					Если НоваяСтрокаТЧ.СтатусСверкиКода = ПредопределенноеЗначение("Перечисление.СтатусыСверкиКодаИСМПТК.Добавлен") Тогда
						НоваяСтрокаТЧ.Количество = 1;
						НоваяСтрокаТЧ.КоличествоИсточник = 1;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.Состояние = РаботаСДокументамиИСМПТК.СостояниеДокументаИСМПТ(ЭтотОбъект);
		
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Автор) Тогда
		ЭтотОбъект.Автор = ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.ТекущийПользователь();
	КонецЕсли;
	
	Если ЭтотОбъект.Направление = Перечисления.НаправленияДокументовИСМПТК.Входящий Тогда
		ЭтотОбъект.Контрагент = ЭтотОбъект.Получатель;
	Иначе
		ЭтотОбъект.Контрагент = ЭтотОбъект.Поставщик;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Статус) Тогда
		ЭтотОбъект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыДокументовИСМПТК.Черновик"); 
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Номер)
		И ЭтотОбъект.Направление = ПредопределенноеЗначение("Перечисление.НаправленияДокументовИСМПТК.Исходящий") Тогда
		ЭтотОбъект.Номер = РаботаСДокументамиИСМПТКПереопределяемый.ПолучитьНомерНаПечать(ЭтотОбъект);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ИдентификаторАПППервичный)
		И ЗначениеЗаполнено(ЭтотОбъект.РегистрационныйНомерСвязанногоАкта) Тогда
		
		ЭтотОбъект.ИдентификаторАПППервичный = ЭтотОбъект.РегистрационныйНомерСвязанногоАкта;
		СтруктураПоиска = Новый Структура("ИмяДокумента,ИмяПараметра,ВидДокумента", 
						ОбщегоНазначенияИСМПТКВызовСервера.ИмяДокументаАктПриемаПередачиИСМПТК(),
						"НомерИСМПТ",
						ПредопределенноеЗначение("Перечисление.ВидыДокументаИСМПТК.Исправленный"));
		СсылкаАППИсправленный = РаботаСДокументамиИСМПТК.НайтиДокументИСПоНомеру(ЭтотОбъект.РегистрационныйНомерСвязанногоАкта, СтруктураПоиска);
		Если Не СсылкаАППИсправленный = Неопределено Тогда 
			ЭтотОбъект.ИдентификаторАППИсправленный = ИнтеграцияИСМПТКПереопределяемый.ЗначениеРеквизитаОбъекта(СсылкаАППИсправленный, "Идентификатор");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтотОбъект.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Идентификатор) Тогда
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ИдентификаторАПППервичный) Тогда
			СсылкаАПППервичный = РаботаСДокументамиИСМПТК.ПолучитьДокументДляОбновленияСвязи(
								 ОбщегоНазначенияИСМПТКВызовСервера.ИмяДокументаАктПриемаПередачиИСМПТК(),
								 ЭтотОбъект.ИдентификаторАПППервичный,
								 "ИдентификаторУведОРасхождениях");
			Если Не СсылкаАПППервичный = Неопределено Тогда
				Попытка 
					ПервичныйАкт = СсылкаАПППервичный.ПолучитьОбъект();
					ПервичныйАкт.ИдентификаторУведОРасхождениях = ЭтотОбъект.Идентификатор;
					ПервичныйАкт.Записать();
				Исключение
					ТекстСообщения = РаботаСТекстамиИСМПТККлиентСервер.ТекстСообщенияПроизошлаОшибкаПриЗаписиДокументаОснования()
								   + Символы.ПС 
								   + ОписаниеОшибки()
								   + Символы.ПС
								   + РаботаСТекстамиИСМПТККлиентСервер.ТекстСообщенияПодробностиВЖурналеРегистрации();
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДокументОснование%", СсылкаАПППервичный);
					ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
					
					ТекстОшибки = РаботаСТекстамиИСМПТККлиентСервер.ТекстСообщенияОшибкаПриЗаписиДокументаСПараметром()
								+ Символы.ПС
								+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ТекстОшибки = ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстОшибки, СсылкаАПППервичный);								 
					ИмяСобытия  = РаботаСТекстамиИСМПТККлиентСервер.ТекстСообщенияИмяСобытияЗаписьДокумента();
					ИмяСобытия  = СтрЗаменить(ИмяСобытия, "%ЗаписываемыйДокумент%", Метаданные.Документы.УведомлениеОРасхожденииИСМПТК.Представление()); 
					ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ИдентификаторАППИсправленный) Тогда
			СсылкаАППИсправленный = РаботаСДокументамиИСМПТК.ПолучитьДокументДляОбновленияСвязи(
								 ОбщегоНазначенияИСМПТКВызовСервера.ИмяДокументаАктПриемаПередачиИСМПТК(),
								 ЭтотОбъект.ИдентификаторАППИсправленный,
								 "ИдентификаторУведОРасхождениях");
			Если Не СсылкаАППИсправленный = Неопределено Тогда
				Попытка 
					ИсправленныйАкт = СсылкаАППИсправленный.ПолучитьОбъект();
					ИсправленныйАкт.ИдентификаторУведОРасхождениях = ЭтотОбъект.Идентификатор;
					ИсправленныйАкт.Записать();
				Исключение
					ТекстСообщения = РаботаСТекстамиИСМПТККлиентСервер.ТекстСообщенияПроизошлаОшибкаПриЗаписиДокументаОснования()
								   + Символы.ПС 
								   + ОписаниеОшибки()
								   + Символы.ПС
								   + РаботаСТекстамиИСМПТККлиентСервер.ТекстСообщенияПодробностиВЖурналеРегистрации();
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДокументОснование%", СсылкаАППИсправленный);
					ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
					
					ТекстОшибки = РаботаСТекстамиИСМПТККлиентСервер.ТекстСообщенияОшибкаПриЗаписиДокументаСПараметром()
								+ Символы.ПС
								+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ТекстОшибки = ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстОшибки, СсылкаАППИсправленный);								 
					ИмяСобытия  = РаботаСТекстамиИСМПТККлиентСервер.ТекстСообщенияИмяСобытияЗаписьДокумента();
					ИмяСобытия  = СтрЗаменить(ИмяСобытия, "%ЗаписываемыйДокумент%", Метаданные.Документы.УведомлениеОРасхожденииИСМПТК.Представление()); 
					ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ДокументОснование = Неопределено; 
	ЭтотОбъект.Идентификатор 	 = Неопределено;
	ЭтотОбъект.НомерИСМПТ = Неопределено;
	ЭтотОбъект.ДатаВИСМПТ = Неопределено;
	ЭтотОбъект.Контрагент = Неопределено;
	ЭтотОбъект.Статус	  = Перечисления.СтатусыДокументовИСМПТК.Черновик;
	ЭтотОбъект.Состояние  = Неопределено;
	ЭтотОбъект.РегистрационныйНомерСвязанногоАкта = Неопределено;
	ЭтотОбъект.Автор = Неопределено;
	ЭтотОбъект.Номер = Неопределено;
	ЭтотОбъект.РегНомерНаБумажномНосителе 	 = Неопределено;
	ЭтотОбъект.ДатаВыпискиНаБумажномНосителе = Неопределено;
	ЭтотОбъект.ИдентификаторАПППервичный  	 = Неопределено;
	ЭтотОбъект.ИдентификаторАППИсправленный  = Неопределено;
	
	ЭтотОбъект.Марки.Очистить();
	ЭтотОбъект.Ошибки.Очистить();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//В общем случае не проверяем заполненность реквизитов при записи
	//проверка необходимых реквизитов проходит при отправке документа
	//в случае необходимости можно указать реквизиты проверки отдельно
	//в процедуре ДокументУОР_ОбработкаПроверкиЗаполнения
	ПроверяемыеРеквизиты.Очистить();
	МассивНепроверяемыхРеквизитов = Новый Массив();
	РаботаСДокументамиИСМПТКПереопределяемый.ДокументУОР_ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	РаботаСДокументамиИСМПТКПереопределяемый.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Если ЭтотОбъект.Направление = ПредопределенноеЗначение("Перечисление.НаправленияДокументовИСМПТК.Входящий") Тогда
		Префикс = "В";
	ИначеЕсли ЭтотОбъект.Направление = ПредопределенноеЗначение("Перечисление.НаправленияДокументовИСМПТК.Исходящий") Тогда
		Префикс = "И";
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
